<template>
	<section>
		<div class="main-info">
			<div class="tr-background">
					<p>人才招聘</p>
					<p>公司提供大量的福利以及晋升机会。</p>
			</div>
			<el-tabs class="tr-info" type="card" @tab-click="handleClick">
				<el-tab-pane label="全部职位" name="first">
					<ul>
						<li v-for="item in trList" class="allList">
							<p class="item-title">{{item.job}} / {{item.department}}</p>
							<p>岗位职责：</p>
							<ol>
								<li v-for="itemD in item.duty">{{itemD.info}}</li>
							</ol>
							<p>岗位要求：</p>
							<ol>
								<li v-for="itemE in item.demand">{{itemE.info}}</li>
							</ol>
						</li>
					</ul>
				</el-tab-pane>
				<el-tab-pane label="行政部" name="second">
					<ul>
						<li v-for="item in trList" class="allList" v-if='item.department == "行政部"'>
							<p class="item-title">{{item.job}} / {{item.department}}</p>
							<p>岗位职责：</p>
							<ol>
								<li v-for="itemD in item.duty">{{itemD.info}}</li>
							</ol>
							<p>岗位要求：</p>
							<ol>
								<li v-for="itemE in item.demand">{{itemE.info}}</li>
							</ol>
						</li>
					</ul>
				</el-tab-pane>
				<el-tab-pane label="财务部" name="third">
					<ul>
						<li v-for="item in trList" class="allList" v-if='item.department == "财务部"'>
							<p class="item-title">{{item.job}} / {{item.department}}</p>
							<p>岗位职责：</p>
							<ol>
								<li v-for="itemD in item.duty">{{itemD.info}}</li>
							</ol>
							<p>岗位要求：</p>
							<ol>
								<li v-for="itemE in item.demand">{{itemE.info}}</li>
							</ol>
						</li>
					</ul>
				</el-tab-pane>
				<el-tab-pane label="运营部" name="fourth">
					<ul>
						<li v-for="item in trList" class="allList" v-if='item.department == "运营部"'>
							<p class="item-title">{{item.job}} / {{item.department}}</p>
							<p>岗位职责：</p>
							<ol>
								<li v-for="itemD in item.duty">{{itemD.info}}</li>
							</ol>
							<p>岗位要求：</p>
							<ol>
								<li v-for="itemE in item.demand">{{itemE.info}}</li>
							</ol>
						</li>
					</ul>
				</el-tab-pane>
				<el-tab-pane label="其他部门" name="five">
					<ul>
						<li v-for="item in trList" class="allList">
							<p class="item-title">{{item.job}} / {{item.department}}</p>
							<p>岗位职责：</p>
							<ol>
								<li v-for="itemD in item.duty">{{itemD.info}}</li>
							</ol>
							<p>岗位要求：</p>
							<ol>
								<li v-for="itemE in item.demand">{{itemE.info}}</li>
							</ol>
						</li>
					</ul>
				</el-tab-pane>
			</el-tabs>
		</div>
		<div>

		</div>
	</section>
</template>

<script>
require('assets/css/components/component_info.css')
require('assets/css/footer/talent_recruitment.less')
export default {
  data: function () {
    return {
			activeName: 'first',
			departments: { "1" : "技术部", "2" : "财务部", "3" : "运营部", "4" : "其他部门"},
			trList: [{
				department: "技术部",    //部门
				job: "产品经理",
				duty: [    //岗位职责
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"}],
				demand: [    //岗位要求
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"}]
				},{
				department: "技术部",
				job: "产品经理",
				duty: [    //岗位职责
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"}],
				demand: [    //岗位要求
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"}]
				},{
				department: "技术部",
				job: "产品经理",
				duty: [    //岗位职责
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"}],
				demand: [    //岗位要求
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"}]
				},{
				department: "技术部",
				job: "产品经理",
				duty: [    //岗位职责
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"}],
				demand: [    //岗位要求
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"}]
			},{
				department: "行政部",
				job: "产品经理",
				duty: [    //岗位职责
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"}],
				demand: [    //岗位要求
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"}]
			},{
				department: "行政部",
				job: "产品经理",
				duty: [    //岗位职责
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"}],
				demand: [    //岗位要求
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"}]
			},{
				department: "行政部",
				job: "产品经理",
				duty: [    //岗位职责
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"}],
				demand: [    //岗位要求
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"}]
			},{
				department: "行政部",
				job: "产品经理",
				duty: [    //岗位职责
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"}],
				demand: [    //岗位要求
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"}]
			},{
				department: "财务部",
				job: "产品经理",
				duty: [    //岗位职责
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"}],
				demand: [    //岗位要求
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"}]
			},{
				department: "运营部",
				job: "产品经理",
				duty: [    //岗位职责
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"},
					{info: "负责公司产品线市场调研，需求分析，产品规划设计与定义；"}],
				demand: [    //岗位要求
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"},
					{info: "对用户体验有优秀的把握，对产品易用性设计和人机交互界面有优秀的直觉，注重细节；"}]
			}
			]
    }
  },
	methods: {
		setShow: function(index) {
			this.trTab.map(function(v,i){
				i == index?v.isCheck = true : v.isCheck = false;
			});
		},
		handleClick(tab, event) {
        console.log(tab, event);
      }
	}
}
</script>